[
    {
        "title": "New & upcoming hackathons · Devpost",
        "link": "https://devpost.com/hackathons",
        "snippet": "Devpost powers hackathons and app contests around the world. Sign up to make new friends, explore new APIs / tech, and win prizes & recognition."
    },
    {
        "title": "Find and organize AI hackathons | Devpost - The home for hackathons",
        "link": "https://devpost.com/c/artificial-intelligence",
        "snippet": "Explore upcoming ai hackathons for opportunities to learn, be inspired and win amazing prizes."
    },
    {
        "title": "Our world has changed. Meet new ... - NEAR MetaBUILD III Hackathon",
        "link": "https://metabuild.devpost.com/forum_topics/36952-i-m-confused-about-the-different-tracks",
        "snippet": "Our world has changed. Meet new challenges in a way a true buidler would do – hack your way to the top. Build the next big thing on NEAR."
    },
    {
        "title": "Google's Immersive Geospatial Challenge: Go beyond the map in ...",
        "link": "https://googlesimmersive.devpost.com/updates/29293-and-the-winners-are",
        "snippet": "And hey, even though the competition is over, you don't have to stop coding! Check out all the new hackathons on Devpost and keep your momentum going! Plus, you ..."
    },
    {
        "title": "New Type Works Hacks 2.0: Join us for this Website Building ...",
        "link": "https://new-type-works-hacks-2-0.devpost.com/",
        "snippet": "Join us for this Website Building Hackathon. This hackathon has ended. Find more hackathons View the winners. Who can participate. Ages ..."
    },
    {
        "title": "Devpost",
        "link": "https://womentechmakers.devpost.com/resources",
        "snippet": "NEW TO HACKATHONS? Never participated in a hackathon before? Check out this video from Women Techmakers to learn more. GOOGLE AI TECHNOLOGY RESOURCES. We ..."
    },
    {
        "title": "Building the Next-Gen Agentic App with GraphRAG & NVIDIA ...",
        "link": "https://arangodbhackathon.devpost.com/",
        "snippet": "Feb 10, 2025 ... Imagine competing in a high-stakes hackathon where the most cutting edge of AI - Agentic Applications, GraphRAG on ArangoDB, and NVIDIA GPU- ..."
    },
    {
        "title": "Find and organize blockchain hackathons | Devpost - The home for ...",
        "link": "https://devpost.com/c/blockchain",
        "snippet": "Explore upcoming blockchain hackathons for opportunities to learn, be inspired and win amazing prizes."
    },
    {
        "title": "IrvineHacks 2025: Create. Connect. Inspire. - Devpost",
        "link": "https://irvinehacks-2025.devpost.com/",
        "snippet": "This category emphasizes the growth and potential of new hackers. Each subcategory evaluates a crucial aspect of the hackathon experience for beginners: their ..."
    },
    {
        "title": "LeedsHack 2025: The University of Leeds' first student-led ...",
        "link": "https://leedshack2025.devpost.com/",
        "snippet": "Feb 10, 2025 ... It's an incredible opportunity for all students, from beginners to experienced hackathon-goers, to learn new skills, work on an exciting project, meet new ..."
    }
]